In [1]:
%matplotlib inline
# Load the "autoreload" extension
%load_ext autoreload
# always reload modules
%autoreload 2
# black formatter for jupyter notebooks
# %load_ext nb_black
# black formatter for jupyter lab
%load_ext lab_black

%run ../../../src/notebook_env.py

---------------------------------
Working on the host: imarevic-pc

---------------------------------
Python version: 3.10.9 | packaged by conda-forge | (main, Feb  2 2023, 20:20:04) [GCC 11.3.0]

---------------------------------
Python interpreter: /home/imarevic/anaconda3/envs/srh/bin/python3.10

# Übung zu Pandas Dataframes

1. Erstellen Sie einen Pandas Dataframe (`df`) wie vorgegeben.
2. Fügen Sie die Spalte `nc_score` $= [2.5, 3, 2.2, 1.0] $ zum Dataframe `df` hinzu.
3. Wählen Sie alle Daten aus, für die gilt `age` $\gt 23 $ und speichern Sie die Werte in den neuen Dataframe `df2`.

|id|Name|Age|
|---|---|---|
|1|John|26|
|2|Alice|20|
|3|Mike|21|
|4|Anne|25|

-------------------------------------------------------

In [2]:
# Frage 1 ...

In [3]:
# Frage 2 ...

In [4]:
# Frage 3 ...

## Lösungen

In [3]:
import pandas as pd

df = pd.DataFrame(
    {
        "id": [1, 2, 3, 4],
        "Name": ["John", "Alice", "Mike", "Anne"],
        "Age": [26, 20, 21, 25],
    }
)
df

   id   Name  Age
0   1   John   26
1   2  Alice   20
2   3   Mike   21
3   4   Anne   25

In [4]:
df["nc_score"] = [2.5, 3, 2.2, 1.0]
df

   id   Name  Age  nc_score
0   1   John   26       2.5
1   2  Alice   20       3.0
2   3   Mike   21       2.2
3   4   Anne   25       1.0

In [5]:
df2 = df.loc[df["Age"] < 23]
df2

   id   Name  Age  nc_score
1   2  Alice   20       3.0
2   3   Mike   21       2.2